## Loan Prediction

In [0]:
#import libraries

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")
%matplotlib inline

In [0]:
#load dataset
data=pd.read_csv("train_loan.csv")
data1=pd.read_csv("test_loan.csv")

In [36]:
data.head()

    Loan_ID Gender Married  ... Credit_History Property_Area Loan_Status
0  LP001002   Male      No  ...            1.0         Urban           Y
1  LP001003   Male     Yes  ...            1.0         Rural           N
2  LP001005   Male     Yes  ...            1.0         Urban           Y
3  LP001006   Male     Yes  ...            1.0         Urban           Y
4  LP001008   Male      No  ...            1.0         Urban           Y

[5 rows x 13 columns]

In [37]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [38]:
data.shape

(614, 13)

In [39]:
data['Loan_Status'].value_counts()

Y    422
N    192
Name: Loan_Status, dtype: int64

In [40]:
data.isnull().sum()       #check missing values

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [0]:
#For numeric features impute mean or median and for categorical impute mode.
data['Gender'].fillna(data['Gender'].mode()[0],inplace=True)
data['Married'].fillna(data['Married'].mode()[0],inplace=True)
data['Dependents'].fillna(data['Dependents'].mode()[0],inplace=True)
data['Self_Employed'].fillna(data['Self_Employed'].mode()[0],inplace=True)
data['LoanAmount'].fillna(data['LoanAmount'].mode(),inplace=True)
data['Loan_Amount_Term'].fillna(data['Loan_Amount_Term'].mode()[0],inplace=True) #360 repeating more times
data['Credit_History'].fillna(data['Credit_History'].mode()[0],inplace=True)

In [42]:
data.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           21
Loan_Amount_Term      0
Credit_History        0
Property_Area         0
Loan_Status           0
dtype: int64

In [46]:
data.drop(columns=['Loan_ID'])   #Loan_Id column is not useful so drop

     Gender Married Dependents  ... Credit_History Property_Area  Loan_Status
0      Male      No          0  ...            1.0         Urban            Y
1      Male     Yes          1  ...            1.0         Rural            N
2      Male     Yes          0  ...            1.0         Urban            Y
3      Male     Yes          0  ...            1.0         Urban            Y
4      Male      No          0  ...            1.0         Urban            Y
..      ...     ...        ...  ...            ...           ...          ...
609  Female      No          0  ...            1.0         Rural            Y
610    Male     Yes         3+  ...            1.0         Rural            Y
611    Male     Yes          1  ...            1.0         Urban            Y
612    Male     Yes          2  ...            1.0         Urban            Y
613  Female      No          0  ...            0.0     Semiurban            N

[614 rows x 12 columns]

In [0]:
pivot=pd.pivot_table(data,values=['ApplicantIncome','CoapplicantIncome'],index='Loan_Status',aggfunc=np.mean)

In [52]:
pivot

             ApplicantIncome  CoapplicantIncome
Loan_Status
N                5446.078125        1877.807292
Y                5384.068720        1504.516398

In [0]:
# If applicants and coapplicants income is less then Loan_status is approved so add some more columns to verify

In [0]:
pivot=pd.pivot_table(data, values=['ApplicantIncome','CoapplicantIncome','LoanAmount','Credit_History'],index='Loan_Status', aggfunc=np.mean)

In [57]:
pivot

             ApplicantIncome  CoapplicantIncome  Credit_History  LoanAmount
Loan_Status
N                5446.078125        1877.807292        0.572917  151.220994
Y                5384.068720        1504.516398        0.983412  144.235437

In [0]:
# Credit_History plays major role while approving Loan

In [63]:
pd.crosstab(index=[data['Gender'],data['Married']],columns='Loan_Status',margins=True )

col_0           Loan_Status  All
Gender Married
Female No                80   80
       Yes               32   32
Male   No               133  133
       Yes              369  369
All                     614  614

In [0]:
data['Loan_Status'].value_counts().plt.barplot